"==============================================Множество в python======================================================"

# Добавляет один элемент в случайныый порядок: add!
fruits1 = {"яблоко", "груша"}
fruits1.add("апельсин")
# print(fruits1): {'яблоко', 'апельсин', 'груша'}

# Добавляет несколько элементов в случайныый порядок: update!
fruits2 = {"яблоко", "груша"}
fruits2.update(["апельсин", "банан"])
# print(fruits2): {'банан', 'яблоко', 'апельсин', 'груша'}

# Удаляет элемент по названию, если такого элемента нет во множестве, вызовит ошибку: remove!
fruits3 = {"яблоко", "груша", "слива"}
fruits3.remove("груша")
# print(fruits3): {'слива', 'яблоко'}

# Безопасное удаление элемента по названию, если такого элемента нет во множестве, не вызовит ошибку: discard!
fruits4 = {"апельсин", "банан", "слива"}
fruits4.discard("груша")
#print(fruits4): {'банан', 'апельсин', 'слива'}

"=====================================Математические операции над множеством==========================================="

# Объединение множества: "|" или ".union"
a = {1, 2, 3}
b = {4, 5, 6}
c1 = a | b
c2 = a.union(b)
# print(c1): {1, 2, 3, 4, 5, 6}
# print(c2): {1, 2, 3, 4, 5, 6}

# Пересечение множества: "&" или ".intersection"
a = {1, 2, 3, 4}
b = {3, 4, 5, 6}
d1 = a & b
d2 = a.intersection(b)
# print(d1): {3, 4}
# print(d2): {3, 4}

# Разность множества: "-" или ".difference"
a = {1, 2, 3, 4}
b = {3, 4, 5, 6}
e1 = a - b
e2 = a.difference(b)
# print(e1): {1, 2}
# print(e2): {1, 2}

# Сравнение множества: "<", ">", "<=", ">=", "==", ".isdisjoint"
a = {1, 4}
b = {1, 2, 3, 4}
r1 = a > b  # Выводит True или False
r2 = a.intersection(b)  # выводит одинаковые элементы (пересечение)
# print(r1): False
# print(r2): {1, 4}

# Неизменяемое множество: "frozenset"
a = {frozenset([1, 2, 3, 4])}
# print(a): {frozenset({1, 2, 3, 4})}

"привет"